Revit 2026 API

# LabelType Enumeration

---

The label type in dimension equality formats.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LabelType
```
```vb
Public Enumeration LabelType
```
```cpp
public enum class LabelType
```
```fsharp
type LabelType
```

| Member name | Value | Description |
| --- | --- | --- |
| LengthOfSegment | 2 | The length of segments of the dimension. |
| NumberOfSegments | 1 | The number of segments of the dimension. |
| NumberOfWitnessLines | 0 | The number of witness lines of the dimension. |
| TotalLength | 3 | The total length of the dimension. |

#### Reference

Autodesk.Revit.DB Namespace